Revit 2027 API
SelectionUIOptions.GetSelectionUIOptions Method
 Returns the current user's SelectionOptions.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static SelectionUIOptions GetSelectionUIOptions()
Public Shared Function GetSelectionUIOptions As SelectionUIOptions
public:
static SelectionUIOptions^ GetSelectionUIOptions()
static member GetSelectionUIOptions : unit -> SelectionUIOptions
Return Value
SelectionUIOptions
 The SelectionOptions for the current user.
See Also
Reference
SelectionUIOptions Class
Autodesk.Revit.UI Namespace